{
    "Tomato Canker": {
        "Name": "Tomato",
        "Health": "Sick",
        "Disease": "Canker",
        "Symptoms": "Tomato canker is a fungal disease that causes lesions on the stems, leaves, and fruit of tomato plants. Lesions are sunken, brown to black, and surrounded by a yellow halo. Lesions may be covered with a white, cottony growth. Lesions on the stems may cause the plant to wilt. Lesions on the leaves may cause the leaves to turn yellow and drop off. Lesions on the fruit may cause the fruit to rot and drop off. Lesions on the fruit may also cause the fruit to become misshapen and deformed. Lesions on the fruit may also cause the fruit to become misshapen and deformed.",
        "Treatment": "There is no cure for tomato canker. Remove and destroy affected plants. Do not compost. Do not plant tomatoes in the same area for 3 years. Rotate crops with non-susceptible crops such as beans, corn, cucumbers, eggplant, peppers, potatoes, and squash. Use resistant varieties. Use row covers to exclude insects.",
        "Prevention": "Remove and destroy affected plants. Do not compost. Do not plant tomatoes in the same area for 3 years. Rotate crops with non-susceptible crops such as beans, corn, cucumbers, eggplant, peppers, potatoes, and squash. Use resistant varieties. Use row covers to exclude insects."
    },
    "Tomato Early Blight": {
        "Name": "Tomato",
        "Health": "Sick",
        "Disease": "Early Blight",
        "Symptoms": "Early blight is a fungal disease that causes lesions on the stems, leaves, and fruit of tomato plants. Lesions are brown to black, and surrounded by a yellow halo. Lesions may be covered with a white, cottony growth. Lesions on the stems may cause the plant to wilt. Lesions on the leaves may cause the leaves to turn yellow and drop off. Lesions on the fruit may cause the fruit to rot and drop off. Lesions on the fruit may also cause the fruit to become misshapen and deformed.",
        "Treatment": "There is no cure for early blight. Remove and destroy affected plants. Do not compost. Do not plant tomatoes in the same area for 3 years. Rotate crops with non-susceptible crops such as beans, corn, cucumbers, eggplant, peppers, potatoes, and squash. Use resistant varieties. Use row covers to exclude insects.",
        "Prevention": "Remove and destroy affected plants. Do not compost. Do not plant tomatoes in the same area for 3 years. Rotate crops with non-susceptible crops such as beans, corn, cucumbers, eggplant, peppers, potatoes, and squash. Use resistant varieties. Use row covers to exclude insects."
    },
    "Tomato Late Blight": {
        "Name": "Tomato",
        "Health": "Sick",
        "Disease": "Late Blight",
        "Symptoms": "Late blight is a fungal disease that causes lesions on the stems, leaves, and fruit of tomato plants. Lesions are brown to black, and surrounded by a yellow halo. Lesions may be covered with a white, cottony growth. Lesions on the stems may cause the plant to wilt. Lesions on the leaves may cause the leaves to turn yellow and drop off. Lesions on the fruit may cause the fruit to rot and drop off. Lesions on the fruit may also cause the fruit to become misshapen and deformed.",
        "Treatment": "There is no cure for late blight. Remove and destroy affected plants. Do not compost. Do not plant tomatoes in the same area for 3 years. Rotate crops with non-susceptible crops such as beans, corn, cucumbers, eggplant, peppers, potatoes, and squash. Use resistant varieties. Use row covers to exclude insects.",
        "Prevention": "Remove and destroy affected plants. Do not compost. Do not plant tomatoes in the same area for 3 years. Rotate crops with non-susceptible crops such as beans, corn, cucumbers, eggplant, peppers, potatoes, and squash. Use resistant varieties. Use row covers to exclude insects."
    },
    "Tomato Leaf Mold": {
        "Name": "Tomato",
        "Health": "Sick",
        "Disease": "Leaf Mold",
        "Symptoms": "Leaf mold is a fungal disease that causes lesions on the leaves of tomato plants. Lesions are brown to black, and surrounded by a yellow halo. Lesions may be covered with a white, cottony growth. Lesions on the leaves may cause the leaves to turn yellow and drop off.",
        "Treatment": "There is no cure for leaf mold. Remove and destroy affected plants. Do not compost. Do not plant tomatoes in the same area for 3 years. Rotate crops with non-susceptible crops such as beans, corn, cucumbers, eggplant, peppers, potatoes, and squash. Use resistant varieties. Use row covers to exclude insects.",
        "Prevention": "Remove and destroy affected plants. Do not compost. Do not plant tomatoes in the same area for 3 years. Rotate crops with non-susceptible crops such as beans, corn, cucumbers, eggplant, peppers, potatoes, and squash. Use resistant varieties. Use row covers to exclude insects."
    },
    "Tomato Septoria Leaf Spot": {
        "Name": "Tomato",
        "Health": "Sick",
        "Disease": "Septoria Leaf Spot",
        "Symptoms": "Septoria leaf spot is a fungal disease that causes lesions on the leaves of tomato plants. Lesions are brown to black, and surrounded by a yellow halo. Lesions may be covered with a white, cottony growth. Lesions on the leaves may cause the leaves to turn yellow and drop off.",
        "Treatment": "There is no cure for septoria leaf spot. Remove and destroy affected plants. Do not compost. Do not plant tomatoes in the same area for 3 years. Rotate crops with non-susceptible crops such as beans, corn, cucumbers, eggplant, peppers, potatoes, and squash. Use resistant varieties. Use row covers to exclude insects.",
        "Prevention": "Remove and destroy affected plants. Do not compost. Do not plant tomatoes in the same area for 3 years. Rotate crops with non-susceptible crops such as beans, corn, cucumbers, eggplant, peppers, potatoes, and squash. Use resistant varieties. Use row covers to exclude insects."
    },
    "Tomato Spider Mites": {
        "Name": "Tomato",
        "Health": "Sick",
        "Disease": "Spider Mites",
        "Symptoms": "Spider mites are tiny, spider-like insects that cause damage to tomato plants. Spider mites cause yellowing and curling of leaves. Spider mites may also cause the leaves to become distorted and deformed. Spider mites may also cause the leaves to become distorted and deformed.",
        "Treatment": "There is no cure for spider mites. Remove and destroy affected plants. Do not compost. Do not plant tomatoes in the same area for 3 years. Rotate crops with non-susceptible crops such as beans, corn, cucumbers, eggplant, peppers, potatoes, and squash. Use resistant varieties. Use row covers to exclude insects.",
        "Prevention": "Remove and destroy affected plants. Do not compost. Do not plant tomatoes in the same area for 3 years. Rotate crops with non-susceptible crops such as beans, corn, cucumbers, eggplant, peppers, potatoes, and squash. Use resistant varieties. Use row covers to exclude insects."
    },
    "Tomato Target Spot": {
        "Name": "Tomato",
        "Health": "Sick",
        "Disease": "Target Spot",
        "Symptoms": "Target spot is a fungal disease that causes lesions on the leaves of tomato plants. Lesions are brown to black, and surrounded by a yellow halo. Lesions may be covered with a white, cottony growth. Lesions on the leaves may cause the leaves to turn yellow and drop off.",
        "Treatment": "There is no cure for target spot. Remove and destroy affected plants. Do not compost. Do not plant tomatoes in the same area for 3 years. Rotate crops with non-susceptible crops such as beans, corn, cucumbers, eggplant, peppers, potatoes, and squash. Use resistant varieties. Use row covers to exclude insects.",
        "Prevention": "Remove and destroy affected plants. Do not compost. Do not plant tomatoes in the same area for 3 years. Rotate crops with non-susceptible crops such as beans, corn, cucumbers, eggplant, peppers, potatoes, and squash. Use resistant varieties. Use row covers to exclude insects."
    },
    "Tomato Yellow Leaf Curl Virus": {
        "Name": "Tomato",
        "Health": "Sick",
        "Disease": "Yellow Leaf Curl Virus",
        "Symptoms": "Yellow leaf curl virus is a viral disease that causes lesions on the leaves of tomato plants. Lesions are brown to black, and surrounded by a yellow halo. Lesions may be covered with a white, cottony growth. Lesions on the leaves may cause the leaves to turn yellow and drop off.",
        "Treatment": "There is no cure for yellow leaf curl virus. Remove and destroy affected plants. Do not compost. Do not plant tomatoes in the same area for 3 years. Rotate crops with non-susceptible crops such as beans, corn, cucumbers, eggplant, peppers, potatoes, and squash. Use resistant varieties. Use row covers to exclude insects.",
        "Prevention": "Remove and destroy affected plants. Do not compost. Do not plant tomatoes in the same area for 3 years. Rotate crops with non-susceptible crops such as beans, corn, cucumbers, eggplant, peppers, potatoes, and squash. Use resistant varieties. Use row covers to exclude insects."
    },
    "Tomato Anthracnose Disease": {
        "Name": "Tomato",
        "Health": "Sick",
        "Disease": "Anthracnose",
        "Symptoms": "Anthracnose is a fungal disease that can cause circular or irregular-shaped spots on leaves and stems. The spots can be dark brown or black with a reddish-brown border. The fungus can also infect the fruit, causing sunken, dark-colored lesions. The fruit lesions can enlarge and merge together, leading to rotting and decay.",
        "Treatment": "Remove and destroy affected plant parts. Do not compost. Do not plant tomatoes in the same area for 3 years. Rotate crops with non-susceptible crops such as beans, corn, cucumbers, eggplant, peppers, potatoes, and squash. Use resistant varieties. Keep plants well-spaced for good air circulation. Fungicides can be used preventatively, but should be applied before symptoms appear.",
        "Prevention": "Rotate crops with non-susceptible crops such as beans, corn, cucumbers, eggplant, peppers, potatoes, and squash. Use resistant varieties. Keep plants well-spaced for good air circulation. Avoid overhead watering. Do not work with plants when they are wet. Clean garden tools and equipment regularly."
    },
    "Tomato Cracking Disease": {
        "Name": "Tomato",
        "Health": "Sick",
        "Disease": "Cracking Disease",
        "Symptoms": "Cracking disease causes cracks on the skin of tomatoes, which can lead to rot and other diseases. Cracks usually appear around the stem end of the fruit and can be concentric or radial. Cracks can also be deep and extend into the flesh of the tomato.",
        "Treatment": "There is no cure for cracking disease. Remove and destroy affected plants. Do not compost. Control irrigation to prevent fluctuations in soil moisture. Maintain consistent soil moisture levels by watering regularly. Avoid overhead irrigation if possible. Use mulch to help conserve soil moisture.",
        "Prevention": "Select varieties that are resistant to cracking. Maintain consistent soil moisture levels by watering regularly. Avoid overhead irrigation if possible. Use mulch to help conserve soil moisture."
    },
    "Tomato Blossom End Rot disease": {
        "Name": "Tomato",
        "Health": "Sick",
        "Disease": "Blossom End Rot",
        "Symptoms": "Blossom end rot is a disorder that causes the bottom of the tomato fruit to turn black and become sunken. The affected area may enlarge and become leathery. Blossom end rot is usually caused by a lack of calcium in the soil, or by uneven watering. It can also be caused by excessive nitrogen, high salt levels in the soil, or root damage.",
        "Treatment": "Correct calcium deficiency by adding lime or gypsum to the soil. Ensure even soil moisture by watering regularly and deeply. Mulch around plants to help conserve moisture. Avoid over-fertilizing with nitrogen. Avoid high salt levels in the soil. Avoid root damage by being careful not to disturb the roots when cultivating or weeding.",
        "Prevention": "Test soil before planting and correct calcium deficiency. Water plants regularly and deeply. Mulch around plants to help conserve moisture. Avoid over-fertilizing with nitrogen. Avoid high salt levels in the soil. Avoid root damage by being careful not to disturb the roots when cultivating or weeding."
    },
    "Tomato Fruit Rot Disease": {
        "Name": "Tomato",
        "Health": "Sick",
        "Disease": "Fruit Rot",
        "Symptoms": "Fruit rot disease causes dark, sunken, circular spots on the fruit. Infected fruit will often become soft and will rot. The fungus causing this disease may also infect the stem, causing the stem to turn brown or black and become soft.",
        "Treatment": "Remove and destroy affected plants. Do not compost. Do not plant tomatoes in the same area for 3 years. Rotate crops with non-susceptible crops such as beans, corn, cucumbers, eggplant, peppers, potatoes, and squash. Use resistant varieties. Keep fruit dry by using drip irrigation, and avoid overhead watering. Fungicides may be used for control.",
        "Prevention": "Remove and destroy affected plants. Do not compost. Do not plant tomatoes in the same area for 3 years. Rotate crops with non-susceptible crops such as beans, corn, cucumbers, eggplant, peppers, potatoes, and squash. Use resistant varieties. Keep fruit dry by using drip irrigation, and avoid overhead watering."
    },
    "Potato Hollow Heart": {
        "Name": "Potato",
        "Health": "Sick",
        "Disease": "Hollow Heart",
        "Symptoms": "Hollow heart is a physiological disorder that causes a hollow cavity in the center of the potato. The cavity is often accompanied by a brown, corky tissue that is not edible. The disorder is caused by irregular growth due to temperature or moisture stress.",
        "Treatment": "There is no cure for hollow heart. Remove and destroy affected plants. Practice proper crop rotation and ensure that the soil is well-drained. Avoid over-fertilization with nitrogen, as this can increase the risk of hollow heart. Harvest potatoes carefully to avoid bruising and other physical damage that can increase the risk of hollow heart.",
        "Prevention": "Practice proper crop rotation and ensure that the soil is well-drained. Avoid over-fertilization with nitrogen, as this can increase the risk of hollow heart. Harvest potatoes carefully to avoid bruising and other physical damage that can increase the risk of hollow heart."
    },
    "Potato Late Blight": {
        "Name": "Potato",
        "Health": "Sick",
        "Disease": "Late Blight",
        "Symptoms": "Late blight is a fungal disease that causes lesions on the leaves and stems of potato plants. Lesions are brown to black, and surrounded by a yellow halo. Lesions may be covered with a white, cottony growth. Lesions on the leaves may cause the leaves to turn yellow and drop off.",
        "Treatment": "There is no cure for late blight. Remove and destroy affected plants. Do not compost. Do not plant potatoes in the same area for 3 years. Rotate crops with non-susceptible crops such as beans, corn, cucumbers, eggplant, peppers, potatoes, and squash. Use resistant varieties. Use row covers to exclude insects.",
        "Prevention": "Remove and destroy affected plants. Do not compost. Do not plant potatoes in the same area for 3 years. Rotate crops with non-susceptible crops such as beans, corn, cucumbers, eggplant, peppers, potatoes, and squash. Use resistant varieties. Use row covers to exclude insects."
    },
    "Potato Early Blight": {
        "Name": "Potato",
        "Health": "Sick",
        "Disease": "Early Blight",
        "Symptoms": "Early blight is a fungal disease that causes lesions on the leaves and stems of potato plants. Lesions are brown to black, and surrounded by a yellow halo. Lesions may be covered with a white, cottony growth. Lesions on the leaves may cause the leaves to turn yellow and drop off.",
        "Treatment": "There is no cure for early blight. Remove and destroy affected plants. Do not compost. Do not plant potatoes in the same area for 3 years. Rotate crops with non-susceptible crops such as beans, corn, cucumbers, eggplant, peppers, potatoes, and squash. Use resistant varieties. Use row covers to exclude insects.",
        "Prevention": "Remove and destroy affected plants. Do not compost. Do not plant potatoes in the same area for 3 years. Rotate crops with non-susceptible crops such as beans, corn, cucumbers, eggplant, peppers, potatoes, and squash. Use resistant varieties. Use row covers to exclude insects."
    }
}